In [136]:
import matplotlib.pyplot as plt
from numpy import set_printoptions
from pandas import read_csv
import numpy as np
import pandas as pd

In [137]:
filename = 'residence.csv'
names = ['PID','HOUSE_NUM','CITY','OWN_OCCUP','NUM_BEDROOMS','NUM_BATHS','SW_FT']
data = read_csv(filename,names = names)

In [138]:
print("The entire data frame is")
data

The entire data frame is

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [139]:
shape = data.shape
print("The dimenstions of the dataframe are",shape)

The dimenstions of the dataframe are (9, 7)

In [140]:
types = data.dtypes
print("The data types of the columns are")
print(types)

The data types of the columns are
PID             float64
HOUSE_NUM       float64
CITY             object
OWN_OCCUP        object
NUM_BEDROOMS     object
NUM_BATHS       float64
SW_FT           float64
dtype: object

In [141]:
print()
print("The top n items of the dataset are")
data.head()

The top n items of the dataset are

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0

In [142]:
data.notnull()

     PID  HOUSE_NUM  CITY  OWN_OCCUP  NUM_BEDROOMS  NUM_BATHS  SW_FT
0   True       True  True       True          True       True   True
1   True       True  True       True          True       True  False
2   True      False  True       True         False       True   True
3   True       True  True      False          True      False   True
4  False       True  True       True          True       True   True
5   True       True  True       True         False       True   True
6   True      False  True      False          True      False   True
7   True       True  True       True          True       True  False
8   True       True  True       True          True       True   True

In [143]:
data.fillna(0)

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     0.0
2  2333.0        0.0         Jaipur         N            0        1.0   850.0
3  4545.0      201.0         Hassan         0            1        0.0   700.0
4     0.0      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y            0        1.0   800.0
6  9897.0        0.0        Madurai         0            2        0.0   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     0.0
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [144]:
data

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [145]:
data.fillna(method ='pad')

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5  1000.0
2  2333.0      197.0         Jaipur         N            3        1.0   850.0
3  4545.0      201.0         Hassan         N            1        1.0   700.0
4  4545.0      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y            3        1.0   800.0
6  9897.0      207.0        Madurai         Y            2        1.0   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0   950.0
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [146]:
data

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [147]:
data["HOUSE_NUM"].fillna("NO NUMBER",inplace=False)

0          104
1          197
2    NO NUMBER
3          201
4          203
5          207
6    NO NUMBER
7          213
8          215
Name: HOUSE_NUM, dtype: object

In [148]:
data

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [149]:
data["OWN_OCCUP"].fillna(0,inplace=False)

0    Y
1    N
2    N
3    0
4    Y
5    Y
6    0
7    Y
8    Y
Name: OWN_OCCUP, dtype: object

In [150]:
data

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [43]:
data["OWN_OCCUP"].fillna(apply_regression(dataset),inplace=True)
print(data)

NameError: name 'apply_regression' is not defined

In [44]:
data.dropna()

      PID  HOUSE_NUM       CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0  Bangalore         Y            3        1.0  1000.0
8  4532.0      215.0    Calicut         Y           na        2.0  1800.0

In [45]:
data

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [46]:
data.dropna(how='all')

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [47]:
data.dropna(axis=1)

            CITY
0      Bangalore
1       NewDelhi
2         Jaipur
3         Hassan
4  Vishakapatnam
5         Meerut
6        Madurai
7     Chandigarh
8        Calicut

In [52]:
data.dropna(thresh=5)

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [66]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace(0, 5)

0    5
1    1
2    2
3    3
4    4
dtype: int64

In [68]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [69]:
df.replace(0, 5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [70]:
df.replace([0, 1, 2, 3], 4)

   A  B  C
0  4  5  a
1  4  6  b
2  4  7  c
3  4  8  d
4  4  9  e

In [71]:
df.replace([0, 1, 2, 3], [4, 3, 2, 1])

   A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

In [72]:
s.replace([1, 2], method='bfill')

0    0
1    3
2    3
3    3
4    4
dtype: int64

In [80]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [81]:
df.replace([1, 2], method='bfill')

   A  B  C
0  0  5  a
1  3  6  b
2  3  7  c
3  3  8  d
4  4  9  e

In [79]:
df.replace({0: 10, 1: 100})

     A  B  C
0   10  5  a
1  100  6  b
2    2  7  c
3    3  8  d
4    4  9  e

In [89]:
df.replace({'A': 0, 'B': 5})

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [90]:
df.replace({'A': {0: 100, 4: 400}})

     A  B  C
0  100  5  a
1    1  6  b
2    2  7  c
3    3  8  d
4  400  9  e

In [91]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [99]:
df.replace({'B': {5: 100, 8: 400}})

   A    B  C
0  0  100  a
1  1    6  b
2  2    7  c
3  3  400  d
4  4    9  e

In [101]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
                   'B': ['abc', 'bar', 'xyz']})
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [108]:
df.replace(to_replace=r'^ba.$', value='new', regex=False)

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [109]:
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [110]:
df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)

      A    B
0   new  abc
1   foo  bar
2  bait  xyz

In [111]:
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [113]:
df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})

      A    B
0   new  abc
1   xyz  new
2  bait  xyz

In [118]:
# importing pandas package 
import pandas as pd 
# making data frame from csv file 
data = pd.read_csv("employees.csv")

In [119]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [120]:
# sorting by first name 
data.sort_values("First Name", inplace = True)

In [121]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
937,Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
...,...,...,...,...,...,...,...,...
902,NaN,Male,5/23/2001,7:52 PM,103877,6.322,NaN,Distribution
925,NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [122]:
# dropping ALL duplicte values 
data.drop_duplicates(subset ="First Name", 
                     keep = False, inplace = True)

In [123]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
688,Brian,Male,4/7/2007,10:47 PM,93901,17.821,True,Legal
190,Carol,Female,3/19/1996,3:39 AM,57783,9.129,False,Finance
887,David,Male,12/5/2009,8:48 AM,92242,15.407,False,Legal
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
495,Eugene,Male,5/24/1984,10:54 AM,81077,2.117,False,Sales
33,Jean,Female,12/18/1993,9:07 AM,119082,16.180,False,Business Development
832,Keith,Male,2/12/2003,3:02 PM,120672,19.467,False,Legal
291,Tammy,Female,11/11/1984,10:30 AM,132839,17.463,True,Client Services

In [130]:
# making data frame from csv file 
data = pd.read_csv("employees.csv")

In [131]:
  
#length before adding row 
length1 = len(data) 
  
# manually inserting duplicate of a row of row 440 
data.loc[1001] = [data["First Name"][440], 
                  data["Gender"][440], 
                  data["Start Date"][440], 
                  data["Last Login Time"][440], 
                  data["Salary"][440], 
                  data["Bonus %"][440], 
                  data["Senior Management"][440], 
                  data["Team"][440]] 
                    
  
# length after adding row 
length2=  len(data)

In [132]:
# sorting by first name 
data.sort_values("First Name", inplace=True) 
print(data)

     First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
1001      Aaron    Male  7/22/1990         2:53 PM   52119   11.343
327       Aaron    Male  1/29/1994         6:48 PM   58755    5.097
440       Aaron    Male  7/22/1990         2:53 PM   52119   11.343
937       Aaron     NaN  1/22/1986         7:39 PM   63126   18.424
101       Aaron    Male  2/17/2012        10:20 AM   61602   11.849
...         ...     ...        ...             ...     ...      ...
902         NaN    Male  5/23/2001         7:52 PM  103877    6.322
925         NaN  Female  8/23/2000         4:19 PM   95866   19.388
946         NaN  Female  9/15/1985         1:50 AM  133472   16.941
947         NaN    Male  7/30/2012         3:07 PM  107351    5.329
951         NaN  Female  9/14/2010         5:19 AM  143638    9.662

     Senior Management             Team
1001              True  Client Services
327               True        Marketing
440               True  Client Services
937              False  Client Services
101               True        Marketing
...                ...              ...
902                NaN     Distribution
925                NaN            Sales
946                NaN     Distribution
947                NaN        Marketing
951                NaN              NaN

[1001 rows x 8 columns]

In [133]:
# dropping duplicate values 
data.drop_duplicates(keep=False,inplace=True) 
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
937,Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
141,Adam,Male,12/24/1990,8:57 PM,110194,14.727,True,Product
...,...,...,...,...,...,...,...,...
902,NaN,Male,5/23/2001,7:52 PM,103877,6.322,NaN,Distribution
925,NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [129]:
# length after removing duplicates 
length3=len(data)
# printing all data frame lengths  
print(length1, length2, length3)

1000 1001 999

In [134]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
937,Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
141,Adam,Male,12/24/1990,8:57 PM,110194,14.727,True,Product
...,...,...,...,...,...,...,...,...
902,NaN,Male,5/23/2001,7:52 PM,103877,6.322,NaN,Distribution
925,NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [135]:
len(data)

999